app/controllers/application_controller.rb

    def index
        appointments = Appointment.all
---
SELECT "appointments".* FROM "appointments"

    def show
        appointment = Appointment.find_by(params[:id])
---
SELECT "appointments".* FROM "appointments" WHERE (1) LIMIT ?  [["LIMIT", 1]]