app/controllers/appointments_controller.rb

SELECT "appointments".* FROM "appointments"
---
    def index
        appointments = Appointment.all

SELECT "appointments".* FROM "appointments" WHERE (1) LIMIT ?  [["LIMIT", 1]]
---
    def show
        appointment = Appointment.find_by(params[:id])